# Задание 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = ['Hello', 'a', [5, 7], 3, None, 4.5, complex(7, 9)]
print(type(my_list[0]), type(my_list[1]), type(my_list[2]), type(my_list[3]), type(my_list[4]), type(my_list[5]), type(my_list[6]))
