# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

def pay(a, b, c):
    return a * b + c

script, hours, rate, bonus = argv

print(pay(int(hours), int(rate), int(bonus)))
